---
kind: other
id: Methods.T:Autodesk.Revit.DB.RoofType
source: html/172d06e2-1d7e-c309-1d48-f63983fc0e36.htm
---
# RoofType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.